# Data Types and Data Wrangling

Prof. Daniel de Abreu Pereira Uhr

### Conte√∫do

* Data Types
  * Dados Num√©ricos
  * Dados de Sequ√™ncia
  * Dados Temporais
  * Dados Ausentes
* Data Wrangling
  * Classificando e Renomeando3
  * Agregando
  * Combinando conjunto de dados
  * Remodelando



### Refer√™ncias

* G√©ron, Aur√©lien. Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems. O'Reilly Media, 2019.
* Athey, S., & Imbens, G. (2017). "The State of Applied Econometrics: Causality and Policy Evaluation." *Journal of Economic Perspectives*.
* Mullainathan, S., & Spiess, J. (2017). "Machine Learning: An Applied Econometric Approach." *Journal of Economic Perspectives*.
* Varian, H. R. (2014). "Big Data: New Tricks for Econometrics." *Journal of Economic Perspectives*.

# Data Types

Para o escopo deste tutorial, usaremos dados Scraped do AirBnb para a cidade de Bolonha. Os dados est√£o dispon√≠veis gratuitamente em Inside AirBnb : http://insideairbnb.com/get-the-data.html .

Usaremos 2 conjuntos de dados:

* conjunto de dados de listagem: cont√©m informa√ß√µes de n√≠vel de listagem
* conjunto de dados de pre√ßos: cont√©m dados de pre√ßos ao longo do tempo

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Import listings data
url_listings = "http://data.insideairbnb.com/italy/emilia-romagna/bologna/2021-12-17/visualisations/listings.csv"
df_listings = pd.read_csv(url_listings)

# Import pricing data
url_prices = "http://data.insideairbnb.com/italy/emilia-romagna/bologna/2021-12-17/data/calendar.csv.gz"
df_prices = pd.read_csv(url_prices, compression="gzip")

### Dados Num√©ricos

M√©todos

* +, -, *,/
* fun√ß√µes numpy
* pd.cut()

As opera√ß√µes matem√°ticas padr√£o entre colunas s√£o feitas por linha.

In [3]:
df_prices['maximum_nights'] - df_prices['minimum_nights']

0           148
1           357
2           357
3           357
4           357
           ...
1260340    1124
1260341    1124
1260342    1124
1260343    1124
1260344    1124
Length: 1260345, dtype: int64

Podemos usar a maioria numpydas opera√ß√µes elemento a elemento em uma √∫nica coluna.

In [4]:
np.log(df_listings['price'])

0       4.219508
1       3.367296
2       3.912023
3       4.836282
4       3.912023
          ...
3448    3.465736
3449    3.806662
3450    3.912023
3451    4.897840
3452    4.744932
Name: price, Length: 3453, dtype: float64

Podemos criar vari√°veis ‚Äã‚Äãcateg√≥ricas a partir de uma num√©rica usando a fun√ß√£o `pd.cut()`.

In [5]:
pd.cut(df_listings['price'], 
       bins = [0, 50, 100, np.inf], 
       labels=['cheap', 'ok', 'expensive'])

0              ok
1           cheap
2           cheap
3       expensive
4           cheap
          ...
3448        cheap
3449        cheap
3450        cheap
3451    expensive
3452    expensive
Name: price, Length: 3453, dtype: category
Categories (3, object): ['cheap' < 'ok' < 'expensive']

### Dados de Sequ√™ncia

M√©todos

* +
* .str.replace
* .str.contains
* .astype(str) -pd.get_dummies()

Podemos usar o operador `+` entre colunas para fazer acr√©scimos em pares.

Nota: n√£o podemos fazer isso com strings.

In [6]:
df_listings['host_name'] + df_listings['neighbourhood']

0                     CarloSanto Stefano
1              EleonoraPorto - Saragozza
2                     PaoloSanto Stefano
3                Anna MariaSanto Stefano
4               ValerioPorto - Saragozza
                      ...
3448                        IleanaNavile
3449           FernandaPorto - Saragozza
3450                        IleanaNavile
3451        Wonderful ItalySanto Stefano
3452    Wonderful ItalyPorto - Saragozza
Length: 3453, dtype: object

Por exemplo, queremos remover o s√≠mbolo de d√≥lar da vari√°vel `price` no conjunto de dados `df_prices`.

In [7]:
df_prices['price'].str.replace('$', '', regex=False)

0           70.00
1           68.00
2           68.00
3           68.00
4           68.00
            ...
1260340    115.00
1260341    115.00
1260342    115.00
1260343    115.00
1260344    115.00
Name: price, Length: 1260345, dtype: object

Algumas dessas fun√ß√µes usam express√µes regulares.

* `match()`: Chame `re.match()` em cada elemento, retornando um booleano.
* `extract()`: Chame `re.match()` em cada elemento, retornando grupos correspondentes como strings.
* `findall()`: Chame `re.findall()` em cada elemento
* `replace()`: Substituir ocorr√™ncias de padr√£o por alguma outra string
* `contains()`: Chame `re.search()` em cada elemento, retornando um booleano
* `count()`: Contar ocorr√™ncias do padr√£o
* `split()`: Equivalente a `str.split()`, mas aceita express√µes regulares `rsplit()`

Por exemplo, o pr√≥ximo c√≥digo verifica se na palavra **centre** ou **center** est√£o contidos na descri√ß√£o do texto.

In [8]:
df_listings['name'].str.contains('centre|center')

0        True
1       False
2        True
3       False
4       False
        ...
3448    False
3449    False
3450    False
3451    False
3452    False
Name: name, Length: 3453, dtype: bool

Por fim, podemos (tentar) converter vari√°veis ‚Äã‚Äãde string em num√©ricas usando `astype(float)`.

In [9]:
df_prices['price'].str.replace('[$|,]', '', regex=True).astype(float)

0           70.0
1           68.0
2           68.0
3           68.0
4           68.0
           ...
1260340    115.0
1260341    115.0
1260342    115.0
1260343    115.0
1260344    115.0
Name: price, Length: 1260345, dtype: float64

Tamb√©m podemos us√°-lo para converter n√∫meros em strings usando `astype(str)`.

In [10]:
df_listings['id'].astype(str)

0          42196
1          46352
2          59697
3          85368
4         145779
          ...
3448    53810648
3449    53820830
3450    53837098
3451    53837654
3452    53854962
Name: id, Length: 3453, dtype: object

Podemos gerar dummies a partir de uma vari√°vel categ√≥rica usando `pd.get_dummies()`.

In [11]:
pd.get_dummies(df_listings['neighbourhood']).head()

,Borgo Panigale - Reno,Navile,Porto - Saragozza,San Donato - San Vitale,Santo Stefano,Savena
0,0,0,0,0,1,0
1,0,0,1,0,0,0
2,0,0,0,0,1,0
3,0,0,0,0,1,0
4,0,0,1,0,0,0

### Dados Temporais

M√©todos

* `pd.to_datetime()`
* `.dt.year`
* `.df.to_period()`
* `pd.to_timedelta()`

No `df_prices` temos uma vari√°vel de data, `date`. Em qual formato ela est√°? Podemos verificar com o atributo `.dtypes`.

In [34]:
df_prices['date'].dtypes

dtype('O')

Podemos converter uma vari√°vel em uma data usando o

In [12]:
df_prices['datetime'] = pd.to_datetime(df_prices['date'])

De fato, se agora verificarmos o formato da vari√°vel `datetime` , √© datetime.

In [13]:
df_prices['datetime'].dtypes

dtype('<M8[ns]')

Quando temos uma vari√°vel em formato `datetime`, ganhamos muitas opera√ß√µes de data e hora por meio do objeto `dt` para propriedades do tipo data e hora.

Por exemplo, podemos extrair o ano usando `.dt.year`. Podemos fazer o mesmo com `month`, `week` e `day`.

In [14]:
df_prices['datetime'].dt.year

0          2021
1          2021
2          2021
3          2021
4          2021
           ...
1260340    2022
1260341    2022
1260342    2022
1260343    2022
1260344    2022
Name: datetime, Length: 1260345, dtype: int64

Podemos alterar o n√≠vel de agrega√ß√£o de uma data usando `.dt.to_period()`. A op√ß√£o `M` converte para o n√≠vel ano-m√™s.

In [15]:
df_prices['datetime'].dt.to_period('M')

0          2021-12
1          2021-12
2          2021-12
3          2021-12
4          2021-12
            ...
1260340    2022-12
1260341    2022-12
1260342    2022-12
1260343    2022-12
1260344    2022-12
Name: datetime, Length: 1260345, dtype: period[M]

Podemos adicionar ou subtrair per√≠odos de tempo de uma data usando a fun√ß√£o `pd.to_timedelta()`. Precisamos especificar a unidade de medida com a op√ß√£o `unit`.

In [16]:
df_prices['datetime'] -  pd.to_timedelta(3, unit='d')

0         2021-12-14
1         2021-12-14
2         2021-12-15
3         2021-12-16
4         2021-12-17
             ...
1260340   2022-12-09
1260341   2022-12-10
1260342   2022-12-11
1260343   2022-12-12
1260344   2022-12-13
Name: datetime, Length: 1260345, dtype: datetime64[ns]

### Dados Ausentes

**M√©todos**

* `.isna()`
* `.dropna()`
* `.fillna()`

A fun√ß√£o isna() relata valores ausentes.

In [17]:
df_listings.isna().head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,True
2,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,True
4,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,True

Para obter uma descri√ß√£o r√°pida da quantidade de dados ausentes no conjunto de dados, podemos usar

In [18]:
df_listings.isna().sum()

id                                   0
name                                 0
host_id                              0
host_name                            9
neighbourhood_group               3453
neighbourhood                        0
latitude                             0
longitude                            0
room_type                            0
price                                0
minimum_nights                       0
number_of_reviews                    0
last_review                        409
reviews_per_month                  409
calculated_host_listings_count       0
availability_365                     0
number_of_reviews_ltm                0
license                           3318
dtype: int64

Podemos remover valores ausentes usando `dropna()`. Ele remove todas as linhas com pelo menos um valor ausente.

In [19]:
df_listings.dropna().shape

(0, 18)

Neste caso, infelizmente, ele descarta todas as linhas. Se quisermos descartar apenas linhas com todos os valores ausentes, podemos usar o par√¢metro how='all'.

In [20]:
df_listings.dropna(how='all').shape

(3453, 18)

Se quisermos descartar apenas valores ausentes para um valor espec√≠fico, podemos usar a op√ß√£o `subset`.

In [21]:
df_listings.dropna(subset=['reviews_per_month']).shape

(3044, 18)

Tamb√©m podemos preencher os valores ausentes em vez de descart√°-los, usando `fillna()`.

In [23]:
df_listings.fillna(' -- Este estava NA  -- ').head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,42196,50 sm Studio in the historic centre,184487,Carlo,-- Este estava NA --,Santo Stefano,44.48507,11.34786,Entire home/apt,68,3,180,2021-11-12,1.32,1,161,6,-- Este estava NA --
1,46352,A room in Pasolini's house,467810,Eleonora,-- Este estava NA --,Porto - Saragozza,44.49168,11.33514,Private room,29,1,300,2021-11-30,2.2,2,248,37,-- Este estava NA --
2,59697,COZY LARGE BEDROOM in the city center,286688,Paolo,-- Este estava NA --,Santo Stefano,44.48817,11.34124,Private room,50,1,240,2020-10-04,2.18,2,327,0,-- Este estava NA --
3,85368,Garden House Bologna,467675,Anna Maria,-- Este estava NA --,Santo Stefano,44.47834,11.35672,Entire home/apt,126,2,40,2019-11-03,0.34,1,332,0,-- Este estava NA --
4,145779,SINGLE ROOM,705535,Valerio,-- Este estava NA --,Porto - Saragozza,44.49306,11.33786,Private room,50,10,69,2021-12-05,0.55,9,365,5,-- Este estava NA --

Tamb√©m podemos criar valores ausentes, se quisermos.

In [24]:
df_listings.iloc[2, 2] = np.nan
df_listings.iloc[:3, :3]

      id                                   name   host_id
0  42196    50 sm Studio in the historic centre  184487.0
1  46352             A room in Pasolini's house  467810.0
2  59697  COZY LARGE BEDROOM in the city center       NaN

# Data Wrangling

Aqui continuamos com os dados Scraped do AirBnb para a cidade de Bolonha. Os dados est√£o dispon√≠veis gratuitamente em Inside AirBnb : http://insideairbnb.com/get-the-data.html .

Usaremos 2 conjuntos de dados:

* conjunto de dados de listagem: cont√©m informa√ß√µes de n√≠vel de listagem
* conjunto de dados de pre√ßos: cont√©m dados de pre√ßos ao longo do tempo

In [29]:
import numpy as np
import pandas as pd

In [30]:
# Import listings data
url_listings = "http://data.insideairbnb.com/italy/emilia-romagna/bologna/2021-12-17/visualisations/listings.csv"
df_listings = pd.read_csv(url_listings)

# Import pricing data
url_prices = "http://data.insideairbnb.com/italy/emilia-romagna/bologna/2021-12-17/data/calendar.csv.gz"
df_prices = pd.read_csv(url_prices, compression="gzip")

### Classificando e Renomeando

Voc√™ pode classificar os dados usando a fun√ß√£o `sort_values`.

Op√ß√µes
* `ascending`: bool ou lista de bool, padr√£o True
* `na_position`: {'primeiro', '√∫ltimo'}, padr√£o '√∫ltimo'

In [31]:
df_listings.sort_values(by=['name', 'price'], 
                        ascending=[False, True], 
                        na_position='last').head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
2280,38601411,üè°Giardino di Annabella-relax in citt√†-casa intera,240803020,Annabella,NaN,Porto - Saragozza,44.49303,11.31986,Entire home/apt,90,2,53,2021-12-13,1.96,1,76,27,392901
2988,48177313,‚ù§ Romantic Suite with SPA Bath ‚ù§ 4starbologna.com,239491712,4 Star Bologna,NaN,Santo Stefano,44.50271,11.34998,Entire home/apt,309,1,1,2021-03-14,0.11,14,344,1,NaN
3302,52367336,‚ú®House of Alchemy‚ú®,140013413,Greta,NaN,Porto - Saragozza,44.49072,11.30890,Entire home/apt,96,2,7,2021-11-28,3.18,1,88,7,NaN
2039,34495335,‚ô• Romantic for Couple in Love ‚ô• | 4 Star Boutique,239491712,4 Star Bologna,NaN,Santo Stefano,44.50368,11.34972,Entire home/apt,143,1,25,2021-08-20,0.79,14,262,6,NaN
2964,47866124,‚ô°Amazing Suite with Private SPA ‚ô° 4starbologna...,239491712,4 Star Bologna,NaN,Santo Stefano,44.50381,11.34951,Entire home/apt,347,1,2,2021-10-17,0.72,14,337,2,NaN

Voc√™ pode remanejar colunas usando a fun√ß√£o `rename()`. Ela recebe um dicion√°rio como argumento `column` no formato {"old_name": "new_name"}.

In [32]:
df_listings.rename(columns={'name': 'listing_name', 
                            'id': 'listing_id'}).head()

,listing_id,listing_name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,3,180,2021-11-12,1.32,1,161,6,NaN
1,46352,A room in Pasolini's house,467810,Eleonora,NaN,Porto - Saragozza,44.49168,11.33514,Private room,29,1,300,2021-11-30,2.20,2,248,37,NaN
2,59697,COZY LARGE BEDROOM in the city center,286688,Paolo,NaN,Santo Stefano,44.48817,11.34124,Private room,50,1,240,2020-10-04,2.18,2,327,0,NaN
3,85368,Garden House Bologna,467675,Anna Maria,NaN,Santo Stefano,44.47834,11.35672,Entire home/apt,126,2,40,2019-11-03,0.34,1,332,0,NaN
4,145779,SINGLE ROOM,705535,Valerio,NaN,Porto - Saragozza,44.49306,11.33786,Private room,50,10,69,2021-12-05,0.55,9,365,5,NaN

### Agregando

Se quisermos contar observa√ß√µes em 2 vari√°veis ‚Äã‚Äãcateg√≥ricas, podemos usar `pd.crosstab()`.

In [33]:
pd.crosstab(df_listings['neighbourhood'], df_listings['room_type'])

room_type,Entire home/apt,Hotel room,Private room,Shared room
neighbourhood,,,,
Borgo Panigale - Reno,107,0,39,0
Navile,250,3,149,1
Porto - Saragozza,842,16,299,10
San Donato - San Vitale,280,1,134,4
Santo Stefano,924,29,237,5
Savena,73,0,48,2

Podemos calcular estat√≠sticas por grupo usando `groupby()`.

In [34]:
df_listings.groupby('neighbourhood')[['price', 'reviews_per_month']].mean()

                              price  reviews_per_month
neighbourhood
Borgo Panigale - Reno     83.020548           0.983488
Navile                   142.200993           1.156745
Porto - Saragozza        129.908312           1.340325
San Donato - San Vitale   91.618138           0.933011
Santo Stefano            119.441841           1.344810
Savena                    69.626016           0.805888

Se voc√™ quiser executar mais de uma fun√ß√£o, talvez em colunas diferentes, voc√™ pode usar `aggregate()` que pode ser abreviado para `agg()`. 

A sintaxe √© `agg(output_var = ("input_var", function))` e aceita tamb√©m fun√ß√µes `numpy`.

In [35]:
df_listings.groupby('neighbourhood').agg(mean_reviews=("reviews_per_month", "mean"),
                                         min_price=("price", "min"),
                                         max_price=("price", np.max)).reset_index()

             neighbourhood  mean_reviews  min_price  max_price
0    Borgo Panigale - Reno      0.983488          9       1429
1                   Navile      1.156745         14       5000
2        Porto - Saragozza      1.340325          7       9999
3  San Donato - San Vitale      0.933011         10       1600
4            Santo Stefano      1.344810         11       9999
5                   Savena      0.805888          9        680

Se quisermos construir uma nova coluna por grupo, podemos usar os dados agrupados `transform()` . Infelizmente, n√£o funciona t√£o bem `aggregate()` e temos que fazer uma coluna de cada vez.

In [36]:
df_listings.groupby('neighbourhood')[['price', 'reviews_per_month']].transform('mean').head()

        price  reviews_per_month
0  119.441841           1.344810
1  129.908312           1.340325
2  119.441841           1.344810
3  119.441841           1.344810
4  129.908312           1.340325

### Combinando conjunto de dados

Podemos concatenar datasets usando `pd.concat()`. Ele recebe como argumento uma lista de dataframes. Por padr√£o, `pd.concat()` executa o outer join. Podemos alter√°-lo usando a op√ß√£o `join` (nesse caso, n√£o faz diferen√ßa).

In [37]:
df_listings1 = df_listings[:2000]
np.shape(df_listings1)

(2000, 18)

In [38]:
df_listings2 = df_listings[1000:]
np.shape(df_listings2)

(2453, 18)

In [39]:
np.shape(
    pd.concat([df_listings1, df_listings2])
)

(4453, 18)

Para mesclar dataframes, podemos usar a fun√ß√£o `pd.merge`.

Op√ß√µes
* how: {'esquerda', 'direita', 'externo', 'interno', 'cruzado'}, padr√£o 'interno'
* on: r√≥tulo ou lista

In [45]:
df_merged = pd.merge(df_listings, df_prices, left_on='id', right_on='listing_id', how='inner')
df_merged.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price_x,...,availability_365,number_of_reviews_ltm,license,listing_id,date,available,price_y,adjusted_price,minimum_nights_y,maximum_nights
0,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,...,161,6,NaN,42196,2021-12-17,f,$68.00,$68.00,3,360
1,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,...,161,6,NaN,42196,2021-12-18,f,$68.00,$68.00,3,360
2,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,...,161,6,NaN,42196,2021-12-19,f,$68.00,$68.00,3,360
3,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,...,161,6,NaN,42196,2021-12-20,f,$68.00,$68.00,3,360
4,42196,50 sm Studio in the historic centre,184487,Carlo,NaN,Santo Stefano,44.48507,11.34786,Entire home/apt,68,...,161,6,NaN,42196,2021-12-21,f,$68.00,$68.00,3,360

Como voc√™ pode ver, como a vari√°vel `price` estava presente em ambos os conjuntos de dados, agora temos a `price.x` e a `price.y`.

### Remodelando

Primeiro, vamos calcular os pre√ßos m√©dios `neighbourhood` usando dateo conjunto de dados mesclado.

In [46]:
df_long = df_merged.groupby(['neighbourhood', 'date'])['price_x'].agg('mean').reset_index()
df_long.head()

           neighbourhood        date    price_x
0  Borgo Panigale - Reno  2021-12-17  83.020548
1  Borgo Panigale - Reno  2021-12-18  83.020548
2  Borgo Panigale - Reno  2021-12-19  83.020548
3  Borgo Panigale - Reno  2021-12-20  83.020548
4  Borgo Panigale - Reno  2021-12-21  83.020548

Isso √© o que chamamos de **formato longo**, pois tem uma ou mais vari√°veis ‚Äã‚Äã( `price_x` neste caso) empilhadas verticalmente ao longo de uma vari√°vel categ√≥rica (`neighborhoode` `date` aqui), que atua como √≠ndice.

A alternativa √© o **formato amplo**, onde temos uma coluna separada para cada bairro.

Podemos remodelar o conjunto de dados **de longo** para **largo** usando o comando `pd.pivot()`.

In [47]:
df_wide = pd.pivot(data=df_long, index='date', columns='neighbourhood').reset_index()
df_wide.head()

                     date               price_x                                \
neighbourhood             Borgo Panigale - Reno      Navile Porto - Saragozza
0              2021-12-17             83.020548  142.200993        129.908312
1              2021-12-18             83.020548  142.200993        129.908312
2              2021-12-19             83.020548  142.200993        129.908312
3              2021-12-20             83.020548  142.200993        129.908312
4              2021-12-21             83.020548  142.200993        129.908312


neighbourhood San Donato - San Vitale Santo Stefano     Savena
0                           91.618138    119.441841  69.626016
1                           91.618138    119.441841  69.626016
2                           91.618138    119.441841  69.626016
3                           91.618138    119.441841  69.626016
4                           91.618138    119.441841  69.626016

Podemos remodelar o conjunto de dados de largo para longo usando o comando `pd.melt()`. Ele aceita os seguintes argumentos

* data: o dataframe
* id_vars: a vari√°vel que estava indexando o antigo conjunto de dados

In [48]:
pd.melt(df_wide, id_vars='date', value_name='price').head()

         date     None          neighbourhood      price
0  2021-12-17  price_x  Borgo Panigale - Reno  83.020548
1  2021-12-18  price_x  Borgo Panigale - Reno  83.020548
2  2021-12-19  price_x  Borgo Panigale - Reno  83.020548
3  2021-12-20  price_x  Borgo Panigale - Reno  83.020548
4  2021-12-21  price_x  Borgo Panigale - Reno  83.020548

Se n√£o tivermos colunas `MultiIndex`, mas apenas um prefixo comum, podemos remodelar o conjunto de dados de largo para longo usando o comando `pd.wide_to_long()`.

In [49]:
df_wide2 = df_wide.copy()
df_wide2.columns = [''.join(col) for col in df_wide2.columns]
df_wide2.head()

,date,price_xBorgo Panigale - Reno,price_xNavile,price_xPorto - Saragozza,price_xSan Donato - San Vitale,price_xSanto Stefano,price_xSavena
0,2021-12-17,83.020548,142.200993,129.908312,91.618138,119.441841,69.626016
1,2021-12-18,83.020548,142.200993,129.908312,91.618138,119.441841,69.626016
2,2021-12-19,83.020548,142.200993,129.908312,91.618138,119.441841,69.626016
3,2021-12-20,83.020548,142.200993,129.908312,91.618138,119.441841,69.626016
4,2021-12-21,83.020548,142.200993,129.908312,91.618138,119.441841,69.626016

O comando `pd.wide_to_long()` aceita os seguintes argumentos

* data: o dataframe
* stubnames: os prefixos das vari√°veis ‚Äã‚Äãque queremos remodelar em uma
* i: a vari√°vel que estava indexando o antigo conjunto de dados
* j: o nome da nova vari√°vel categ√≥rica que extra√≠mos destubnames
* suffix: express√£o regular do sufixo, o padr√£o √© \d+, ou seja, d√≠gitos

In [50]:
pd.wide_to_long(df_wide2, stubnames='price_x', i='date', j='neighborhood', suffix='\D+').head()

                                    price_x
date       neighborhood
2021-12-17 Borgo Panigale - Reno  83.020548
2021-12-18 Borgo Panigale - Reno  83.020548
2021-12-19 Borgo Panigale - Reno  83.020548
2021-12-20 Borgo Panigale - Reno  83.020548
2021-12-21 Borgo Panigale - Reno  83.020548

Observe que tivemos que alterar o `suffix` para `\D+`, ou seja, n√£o d√≠gitos.

### Fun√ß√£o da Janela

M√©todos

* shift()
* expanding()
* rolling()

Quando temos dados de s√©ries temporais, podemos querer fazer opera√ß√µes ao longo do tempo. Primeiro, vamos agregar o conjunto de dados `df_price` no n√≠vel ano-m√™s.

In [51]:
temp = df_prices.copy()
temp['price'] = temp['price'].str.replace('[$|,]', '', regex=True).astype(float)
temp['date'] = pd.to_datetime(temp['date']).dt.to_period('M')
temp = temp.groupby(['listing_id', 'date'])['price'].mean().reset_index()\
    .sort_values(by=['listing_id', 'date'], ascending=[False, True])
temp.head()

       listing_id     date       price
44876    53854962  2021-12  147.400000
44877    53854962  2022-01  137.645161
44878    53854962  2022-02  124.642857
44879    53854962  2022-03  285.096774
44880    53854962  2022-04  115.000000

Podemos adiantar ou atrasar uma vari√°vel usando `shift()`.

In [52]:
temp['price1'] = temp['price'].shift(1)
temp.head(15)

       listing_id     date       price      price1
44876    53854962  2021-12  147.400000         NaN
44877    53854962  2022-01  137.645161  147.400000
44878    53854962  2022-02  124.642857  137.645161
44879    53854962  2022-03  285.096774  124.642857
44880    53854962  2022-04  115.000000  285.096774
44881    53854962  2022-05  115.000000  115.000000
44882    53854962  2022-06  115.000000  115.000000
44883    53854962  2022-07  115.000000  115.000000
44884    53854962  2022-08  115.000000  115.000000
44885    53854962  2022-09  115.000000  115.000000
44886    53854962  2022-10  115.000000  115.000000
44887    53854962  2022-11  115.000000  115.000000
44888    53854962  2022-12  115.000000  115.000000
44863    53837654  2021-12  184.133333  115.000000
44864    53837654  2022-01  148.741935  184.133333

Se quisermos liderar ou atrasar uma vari√°vel dentro de um grupo , podemos combinar `shift()` com `groupby()`.

In [53]:
temp['price1'] = temp.groupby('listing_id')['price'].shift(1)
temp.head(15)

       listing_id     date       price      price1
44876    53854962  2021-12  147.400000         NaN
44877    53854962  2022-01  137.645161  147.400000
44878    53854962  2022-02  124.642857  137.645161
44879    53854962  2022-03  285.096774  124.642857
44880    53854962  2022-04  115.000000  285.096774
44881    53854962  2022-05  115.000000  115.000000
44882    53854962  2022-06  115.000000  115.000000
44883    53854962  2022-07  115.000000  115.000000
44884    53854962  2022-08  115.000000  115.000000
44885    53854962  2022-09  115.000000  115.000000
44886    53854962  2022-10  115.000000  115.000000
44887    53854962  2022-11  115.000000  115.000000
44888    53854962  2022-12  115.000000  115.000000
44863    53837654  2021-12  184.133333         NaN
44864    53837654  2022-01  148.741935  184.133333

Podemos realizar opera√ß√µes cumulativas `expanding()` usando a fun√ß√£o

In [54]:
temp['avg_cum_price'] = temp['price'].expanding().mean()
temp.head(15)

       listing_id     date       price      price1  avg_cum_price
44876    53854962  2021-12  147.400000         NaN     147.400000
44877    53854962  2022-01  137.645161  147.400000     142.522581
44878    53854962  2022-02  124.642857  137.645161     136.562673
44879    53854962  2022-03  285.096774  124.642857     173.696198
44880    53854962  2022-04  115.000000  285.096774     161.956959
44881    53854962  2022-05  115.000000  115.000000     154.130799
44882    53854962  2022-06  115.000000  115.000000     148.540685
44883    53854962  2022-07  115.000000  115.000000     144.348099
44884    53854962  2022-08  115.000000  115.000000     141.087199
44885    53854962  2022-09  115.000000  115.000000     138.478479
44886    53854962  2022-10  115.000000  115.000000     136.344072
44887    53854962  2022-11  115.000000  115.000000     134.565399
44888    53854962  2022-12  115.000000  115.000000     133.060369
44863    53837654  2021-12  184.133333         NaN     136.708438
44864    53837654  2022-01  148.741935  184.133333     137.510671

Para executar opera√ß√µes cumulativas dentro de um grupo , podemos combinar `expanding()` com `groupby()`. Como grupos com observa√ß√µes insuficientes s√£o descartados, precisamos mesclar o conjunto de dados novamente.

In [55]:
temp.groupby('listing_id')['price'].expanding().mean().reset_index(level=0).head(15)

    listing_id      price
0        42196  68.000000
1        42196  68.000000
2        42196  68.000000
3        42196  68.000000
4        42196  68.000000
5        42196  68.000000
6        42196  68.000000
7        42196  68.000000
8        42196  68.000000
9        42196  68.000000
10       42196  68.000000
11       42196  68.000000
12       42196  68.000000
13       46352  29.333333
14       46352  29.311828

Se quisermos realizar uma opera√ß√£o sobre uma janela rolante , podemos usar a fun√ß√£o `rolling()`

In [56]:
temp['avg3_price'] = temp['price'].rolling(3).mean()
temp.head(15)

       listing_id     date       price      price1  avg_cum_price  avg3_price
44876    53854962  2021-12  147.400000         NaN     147.400000         NaN
44877    53854962  2022-01  137.645161  147.400000     142.522581         NaN
44878    53854962  2022-02  124.642857  137.645161     136.562673  136.562673
44879    53854962  2022-03  285.096774  124.642857     173.696198  182.461598
44880    53854962  2022-04  115.000000  285.096774     161.956959  174.913210
44881    53854962  2022-05  115.000000  115.000000     154.130799  171.698925
44882    53854962  2022-06  115.000000  115.000000     148.540685  115.000000
44883    53854962  2022-07  115.000000  115.000000     144.348099  115.000000
44884    53854962  2022-08  115.000000  115.000000     141.087199  115.000000
44885    53854962  2022-09  115.000000  115.000000     138.478479  115.000000
44886    53854962  2022-10  115.000000  115.000000     136.344072  115.000000
44887    53854962  2022-11  115.000000  115.000000     134.565399  115.000000
44888    53854962  2022-12  115.000000  115.000000     133.060369  115.000000
44863    53837654  2021-12  184.133333         NaN     136.708438  138.044444
44864    53837654  2022-01  148.741935  184.133333     137.510671  149.291756